CSI API ETABS v1
cFunction.GetNameList Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName,
	int FuncType = 0
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	Optional FuncType As Integer = 0
) As Integer
Dim instance As cFunction
Dim NumberNames As Integer
Dim MyName As String()
Dim FuncType As Integer
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName, FuncType)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName,
	int FuncType = 0
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref *
        ?FuncType : int
(* Defaults:
        let _FuncType = defaultArg FuncType 0
*)
-> int
Parameters
NumberNames
Type: System.Int32
MyName
Type: System.String[]
FuncType (Optional)
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cFunction Interface
ETABSv1 Namespace